app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    post = Post.find(params[:id])