app/controllers/comments_controller.rb

  def create
    # comment = Comment.new(author_id: current_user.id, post_id: post.id, text: comments_params[:text])
    # if comment.save
    #   flash[:notice] = 'Comment created successfully'
    # else
    #   flash[:error] = 'Error'
    # end
    # redirect_to user_post_comments_path

    @comment = Comment.new(comments_params)
    @comment.post = @post
    @comment.author = current_user
    if @comment.save
---
INSERT INTO "comments" ("text", "created_at", "updated_at", "author_id", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "you are right"], ["created_at", "2022-11-10 10:20:11.546204"], ["updated_at", "2022-11-10 10:20:11.546204"], ["author_id", 13], ["post_id", 1]]

  def destroy
    @comment = Comment.find(params[:id])
    @post = Post.find(@comment.post_id)
    @post.comments_counter -= 1
    @comment.destroy
    @post.save
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 9]]
UPDATE "posts" SET "comments_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_counter", 0], ["updated_at", "2022-11-10 16:01:05.987272"], ["id", 26]]