app/controllers/likes_controller.rb

  def create
    @post = Post.find(params[:id])

    @like = current_user.likes.new(
      author_id: current_user.id,
      post_id: @post.id
    )

    if @like.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("created_at", "updated_at", "author_id", "post_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-11-10 10:20:17.527700"], ["updated_at", "2022-11-10 10:20:17.527700"], ["author_id", 13], ["post_id", 1]]