app/models/comment.rb

  def update_comments_counter
    post.increment!(:comments_counter)
---
UPDATE "posts" SET "comments_counter" = COALESCE("comments_counter", 0) + $1 WHERE "posts"."id" = $2  [["comments_counter", 1], ["id", 21]]

  def update_comments_down
    post.update_columns('comments_counter' => post.comments_counter - 1)
---
UPDATE "posts" SET "comments_counter" = $1 WHERE "posts"."id" = $2  [["comments_counter", 0], ["id", 24]]